Revit 2027 API
SweptBlend.BottomSketch Property
The bottom profile sketch of the swept blend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Sketch BottomSketch { get; }
Public ReadOnly Property BottomSketch As Sketch
	Get
public:
property Sketch^ BottomSketch {
	Sketch^ get ();
}
member BottomSketch : Sketch with get
Property Value
Sketch
Remarks
If the bottom profile is based on a family symbol, this property is null.
See Also
Reference
SweptBlend Class
Autodesk.Revit.DB Namespace